#+TITLE: My emacs configuration
#+AUTHOR: Mijail Aron Alvarez Cerrillo
#+EMAIL: mijail.iso@ciencias.unam.mx
*** ORG
    Visual line mode in org mode
    #+begin_src emacs-lisp
    (add-hook 'org-mode-hook '(lambda () (visual-line-mode 1)))
    #+end_src

     Make windmove work in org-mode
     #+BEGIN_SRC emacs-lisp
     (add-hook 'org-shiftup-final-hook 'windmove-up)
     (add-hook 'org-shiftleft-final-hook 'windmove-left)
     (add-hook 'org-shiftdown-final-hook 'windmove-down)
     (add-hook 'org-shiftright-final-hook 'windmove-right)
     #+END_SRC

     Work with SRC blocks
     #+BEGIN_SRC emacs-lisp
     (setq org-src-fontify-natively t
	   org-src-tab-acts-natively t
	   org-confirm-babel-evaluate nil
	   org-edit-src-content-indentation 0)
     #+END_SRC

     Dark background org blocks
     #+BEGIN_SRC emacs-lisp
     (require 'color)
     (set-face-attribute 'org-block nil :background
			 (color-darken-name
			  (face-attribute 'default :background) 3))
     #+END_SRC

    Add org-mode to AC
    #+BEGIN_SRC emacs-lisp
    (add-to-list 'ac-modes 'org-mode)
    #+END_SRC   

    Org-bullets
    #+BEGIN_SRC emacs-lisp
    (require 'org-bullets)
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
    #+END_SRC

    Org-mode
    #+BEGIN_SRC emacs-lisp
    (require 'org)
    #+END_SRC

    Evaluate src code without confirmation.
    #+BEGIN_SRC emacs-lisp
      (setq org-confirm-babel-evaluate nil)
    #+END_SRC

    Active Babel languages
    #+BEGIN_SRC emacs-lisp
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((python . t)
       (java . t)
       (haskell . t)
       (emacs-lisp . t)
       (js . t)
       (R . t)
       (ruby . t)
       (C . t)
       (shell . t)
       ))
    #+END_SRC
    Org-mind-map
    #+begin_src emacs-lisp
					    ;(load "/home/mijail/.emacs.d/elpa/org-mind-map-20180826.2340/org-mind-map.el")
    ;; This is an Emacs package that creates graphviz directed graphs from
    ;; the headings of an org file
    (use-package org-mind-map
      :init
      (require 'ox-org)
      :ensure t
      ;; Uncomment the below if 'ensure-system-packages` is installed
      ;;:ensure-system-package (gvgen . graphviz)
      :config
      (setq org-mind-map-engine "dot")       ; Default. Directed Graph
      ;; (setq org-mind-map-engine "neato")  ; Undirected Spring Graph
      ;; (setq org-mind-map-engine "twopi")  ; Radial Layout
      ;; (setq org-mind-map-engine "fdp")    ; Undirected Spring Force-Directed
      ;; (setq org-mind-map-engine "sfdp")   ; Multiscale version of fdp for the layout of large graphs
      ;; (setq org-mind-map-engine "twopi")  ; Radial layouts
      ;; (setq org-mind-map-engine "circo")  ; Circular Layout
      )
    #+end_src

    Org-Agenda
    #+begin_src emacs-lisp
    (global-set-key "\C-cl" 'org-store-link)
    (global-set-key "\C-ca" 'org-agenda)
    (global-set-key (kbd "C-c c") 'org-capture)
    #+end_src

    The following customization sets a default target file for notes.
    #+begin_src emacs-lisp
    (setq org-default-notes-file "~/Dropbox/org/notes.org")
    #+end_src

    Agenda files
    #+begin_src emacs-lisp
    (setq org-agenda-files '("~/Dropbox/org/mylife.org"))
    #+end_src

    #+RESULTS:
    | ~/Dropbox/org/mylife.org |

    LOGS go into a DRAWER (name of drawer LOGBOOK)
    #+begin_src emacs-lisp
    (setq org-log-into-drawer t)
    #+end_src

    HABITS
    #+begin_src emacs-lisp
    (setq org-modules '(org-habit))
    (eval-after-load 'org
     '(org-load-modules-maybe t))
    #+end_src

    Ordered tasks, tasks should be completed one after the other.
    #+begin_src emacs-lisp
    (setq org-enforce-todo-dependencies t)
    (setq org-track-ordered-property-with-tag t)
    (setq org-agenda-dim-blocked-tasks t)
    (setq org-enforce-todo-checkbox-dependencies t)
    #+end_src

    Org refile targets to other files of agenda
    #+begin_src emacs-lisp
    (setq org-refile-allow-creating-parent-nodes '(confirm))
    (setq org-refile-targets '((nil :maxlevel . 9)
			       (org-agenda-files :maxlevel . 9)))
    (setq org-outline-path-complete-in-steps nil)         ; Refile in a single go
    (setq org-refile-use-outline-path t)                  ; Show full paths for refiling
    #+end_src

    #+RESULTS:
    : t
*** Capture Templates
    #+begin_src emacs-lisp
    (setq org-capture-templates
	  '(
	    ;; Templates for the READ keyword sequence
	    ("r" "Read")
	    ;; BOOK (b) Book template
	    ("rb" "Book" entry
	     (file+headline "~/Dropbox/org/mylife.org" "Books")
	     "* SOMEDAY %^{Title}
      - Recommended by %^{recommended by}
      :PROPERTIES:
      :AUTHOR: %^{Author}
      :PAGES: %^{Pages}
      :GENRE: %^{Genre}
      :LINK: %^{Link%:url}
      :END:
      :LOGBOOK:
      - Added: %U
      :END:"
	     :empty-lines 1)

	    ;; Template for Todo
	    ("t" "Todo" entry
	     (file+headline "~/Dropbox/org/mylife.org" "Things to do")
	     "* TODO %^{Todo}
      %?
      :LOGBOOK:
      - Added: %U
      :END:"
	     :empty-lines 1)

	    ;; Template fo Someday
	    ("s" "Someday" entry
	     (file+headline "~/Dropbox/org/mylife.org" "Someday")
	     "* SOMEDAY %^{Someday}
      %?
      :LOGBOOK:
      - Added: %U
      :END:"
	     :empty-lines 1)

	    ))
    #+end_src

    #+RESULTS:
    | r  | Read |       |                                                |                     |
    | rb | Book | entry | (file+headline ~/Dropbox/org/mylife.org Books) | * SOMEDAY %^{Title} |
